# 문제 : https://www.acmicpc.net/problem/14500

n, m = map(int, input().split())
grid = [list(map(int, input().split())) for _ in range(n)]

blocks = [
# 일직선 블럭
((0, 0), (1, 0), (2, 0), (3, 0)),
((0, 0), (0, 1), (0, 2), (0, 3)),
# 네모 블럭
((0, 0), (1, 0), (0, 1), (1, 1)),
# ㄱ 블럭
((0, 0), (1, 0), (2, 0), (0, -1)),
((0, 0), (1, 0), (2, 0), (0, 1)),
((0, 0), (1, 0), (2, 0), (2, -1)),
((0, 0), (1, 0), (2, 0), (2, 1)),
((0, 0), (0, 1), (0, 2), (1, 2)),
((0, 0), (0, 1), (0, 2), (-1, 2)),
((0, 0), (0, 1), (0, 2), (1, 0)),
((0, 0), (0, 1), (0, 2), (-1, 0)),
# ㄴㄱ 블럭
((0, 0), (1, 0), (1, 1), (2, 1)),
((0, 0), (0, 1), (-1, 1), (-1, 2)),
# ㄴㄱ reverse 블럭
((0, 0), (1, 0), (1, -1), (2, -1)),
((0, 0), (0, 1), (1, 1), (1, 2)),
# ㅗ
((0, 0), (0, 1), (0, 2), (-1, 1)),
# ㅏ
((0, 0), (1, 0), (-1, 0), (0, 1)),
# ㅜ
((0, 0), (0, 1), (0, 2), (1, 1)),
# ㅓ
((0, 0), (1, 0), (-1, 0), (0, -1))
]

def check(block, x, y):
    score = 0
    for c in block:
        dx = x + c[0]
        dy = y + c[1]
        if 0 <= dx < n and 0 <= dy < m:
            score += grid[dx][dy]
        else:
            return 0
    return score

maxx = 0
for i in range(n):
    for j in range(m):
        for block in blocks:
            maxx = max(maxx, check(block, i, j))

print(maxx)